## set profile
```
OS10(config)# switch-port-profile 1/1 profile-2
```

## set port speed
```
OS10(config)# interface breakout 1/1/25 map 40g-1x
OS10(config)# interface breakout 1/1/26 map 40g-1x
```
## set vlan 
```
OS10(config)# interface vlan 20
OS10(config)# no interface vlan 20
OS10(config)# interface range ethernet 1/1/1-1/1/20
OS10(conf-range-eth1/1/1-1/1/20)# switchport mode access
OS10(conf-range-eth1/1/1-1/1/20)# switchport access vlan 20
```
## set port-channel
```
OS10(config)# interface port-channel 100
OS10(config)# switchport mode access
OS10(config)# switchport access vlan 20
OS10(config)# interface range ethernet 1/1/53-1/1/54
OS10(conf-range-eth1/1/53-1/1/54)# channel-group 100 mode on
```